//
// Created by David Arsov on 4.12.25.
//

#include <iostream>

using namespace std;

// Потребно е да се пронајдат и избројат сите појавувања на
// обликот „Х“ составен само од елементите со вредност 1.
// Обликот „Х“ е составен од 5 елементи со вредност 1 кои
// се соодветно распределни во матрицата (елемент со
// вредност 1 кој има елементи со вредност 1 како негови
// дијагонални соседи).
//
// Од стандарден влез се вчитуваат димензиите на
// една матрица и елементите на истата. Потребно е
// да ги изброите сите појавувања на обликот „Х“ во
// рамките на матрицата. Да се претпостави дека не
// смее да има поклопување на елементите од
// два облика „Х“ (пример 2). Појавувањата на
// обликот „Х“ се бараат одлево-надесно и одгоре-надоле.
//


int main() {

    int n, m;
    int a[100][100];
    cin >> n >> m;

    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            cin >> a[i][j];
        }
    }

    int brojac = 0;

    for (int i = 1; i < n - 1; i++) {
        for (int j = 1; j < m - 1; j++) {
            int gore = a[i - 1][j];
            int dolu = a[i + 1][j];

            int desno = a[i][j + 1];
            int levo = a[i][j - 1];
            int centar = a[i][j];

            if (gore == 1 && dolu == 1
                && desno == 1 && levo == 1
                && centar == 1) {
                brojac++;
            }
        }
    }

    cout << "Vo matricata ima " << brojac << " x-ovi";
    return 0;
}