//
// Created by David Arsov on 9.10.25.
//

#include <iostream>

using namespace std;

// Да се напише програма каде од тастатура ќе се внесе датумот на раѓање во формат (ddmmgggg).
// Програмата на компјутерскиот екран ќе го испечати денот и месецот на раѓање.

// Пример: Ако се внесе следниот број: 18091992, програмата ќе испечати: 18.9
// ПОМОШ: Искористете целобројно делење и остаток од делење.

int main() {

    int datum;
    cin >> datum;

    int mesec = datum / 10000 % 100;
    int den = datum / 1000000;

    cout << den << "." << mesec << endl;


    return 0;
}